Repository: jiya-talreja/multi_language_detection
Catalog: backend/input/opus/en-hi.tmx
Source language: en
Languages: hi

source: Are you guys OK?
hi: क्या आप लोग ठीक हो?

source: You're not even listening.
hi: तुम तो सुन भी नहीं रहे हो।

source: You're standing on my foot.
hi: तुम मेरे पैर पर खड़े हो।

source: You said you wouldn't do that.
hi: तुम ने कहा था तुम वैसा नहीं करोगे।

source: You've had too much to drink.
hi: तुम ने कुछ ज़्यादा ही पी ली है।

source: You've got three months left.
hi: तुम्हारे पास तीन महीने बचे हैं।

source: You should've studied harder.
hi: तुम्हें और मेहनत से पढ़ाई करनी चाहिए थी।

source: You really do look beautiful.
hi: तुम तो सच-मुच सुंदर लगती हो।

source: You need this more than I do.
hi: मुझ से ज़्यादा तुम्हें इसकी ज़रूरत है।

source: You've got a lot of enemies.
hi: तुम्हारे बहुत सारे दुशमन हैं।

source: You shouldn't even be here.
hi: तुम्हें तो यहाँ होना भी नहीं चाहिए।

source: You and I aren't like that.
hi: तुम और मैं वैसे नहीं हैं।

source: You're making a mistake.
hi: तुम गलती कर रहे हो।

source: You have a lot to learn.
hi: तुम्हें अभी बहुत कुछ सीखना है।

source: You aren't even trying.
hi: तुम तो कोशिश भी नहीं कर रहे।

source: You'll lose.
hi: तुम हारोगे।

source: I can't find my umbrella.
hi: मुझे मेरा छाता नहीं मिल रहा।

source: Tom saw somebody.
hi: टॉम ने किसी को देखा।

source: Who did Tom kiss?
hi: टौम ने किस को चूमा?

source: Tom likes running.
hi: टॉम को भागना पसंद है।

source: Tom broke a glass.
hi: टॉम ने एक काँच तोड़ी।

source: Yemen is a country in the Middle East.
hi: येमेन मध्य-पूर्व में एक देश है।

source: What's up there?
hi: वहाँ उपर क्या है?

source: What's all this?
hi: यह सब क्या है?

source: It's still hot.
hi: अभी भी बहुत गरम है।

source: What room is Tom in?
hi: टॉम किस कमरे में है?

source: Why can't Tom do it?
hi: टॉम क्यों नहीं कर सकता?

source: What'll Tom do now?
hi: अब टॉम क्या करेगा?

source: Does Tom like swimming?
hi: क्या टॉम को तैरना पसंद है?

source: How does Tom do this?
hi: टॉम यह कैसे करता है?

source: Hey, where's Tom?
hi: अरे, टॉम कहाँ है?

source: What should we do now?
hi: अब हम क्या करें?

source: That game was fun.
hi: उस खेल में बहुत मज़ा आया।

source: What should I have done?
hi: मुझे क्या करना चाहिए था?

source: The ink is still wet.
hi: सियाही अभी भी गीली है।

source: There are nine people in my family.
hi: मेरे परिवार में नौ जन हैं।

source: Get over here, Tom.
hi: यहाँ आ जाओ, टॉम।

source: Look around you, Tom.
hi: आसपास देखो, टॉम।

source: I later found out that he was gay.
hi: मुझे बाद में पता चला कि वह गे था।

source: You don't seem afraid at all.
hi: तुम बिलकुल भी डरे हुए नहीं लगते हो।

source: You don't seem tired at all.
hi: तुम तो बिलकुल भी थके हुए नहीं लगते हो।

source: You weren't even there yesterday.
hi: तुम तो वहाँ कल थे भी नहीं।

source: You should've called the cops.
hi: पुलिस को बुलाना चाहिए था।

source: I hear you're getting married again.
hi: सुना है तुम फिर से शादी कर रहे हो।

source: You put in too much sugar.
hi: तुम कुछ ज़्यादा ही शक्कर डालते हो।

source: I don't do stuff like that.
hi: मैं वैसी चीजें नहीं करता।

source: You don't even know my name.
hi: तुम तो मेरा नाम तक नहीं जानते।

source: You're lying now, aren't you?
hi: तुम अभी झूठ बोल रहे हो, है ना?

source: You don't even know who I am.
hi: आप तो यह भी जानते कि मैं कौन हूँ।

source: You do like music, don't you?
hi: तुम्हें संगीत तो पसंद है, है ना?

source: You didn't even know me then.
hi: तब तो तुम मुझे जानते भी नहीं थे।

source: That's real gold.
hi: वह असली सोना है।

source: I will fight you.
hi: मैं तुम से लड़ूंगा।

source: I'll marry you.
hi: मैं तुम से शादी करूंगा।

source: I can do it, too.
hi: मैं भी कर सकता हूँ।

source: That's good, too.
hi: वह भी अच्छा है।

source: I do mean that.
hi: मेरा वहीं मतलब है।

source: I'm the surgeon.
hi: सर्जन मैं हूँ।

source: We chose this one.
hi: हमने यह वाला चुना।

source: You can help me.
hi: तुम मेरी मदद कर सकते हो।

source: Bring the kids.
hi: बच्चों को लाओ।

source: I believe in it.
hi: मुझे उसमें विश्वास है।

source: Now it's here.
hi: अभी यहाँ है।

source: Who's it for?
hi: किस के लिये है?

source: It's so clean.
hi: कितना साफ है।

source: Hide that book.
hi: वह किताब छिपाओ।

source: I was not drinking.
hi: मैं नहीं पी रहा था।

source: Tom takes after his mother.
hi: टॉम अपनी माँ पर गया है।

source: This is my Japanese friend.
hi: यह मेरा जापानी दोस्त है।

source: This is not my Japanese friend.
hi: यह मेरा जापानी दोस्त नहीं है।

source: I drink tea, too.
hi: मैं चाय भी पीता हूँ।

source: India is in Asia.
hi: भारत एशिया में है।

source: He wants to work in China for two years.
hi: वह चीन में दो साल काम करना चाहता है।

source: Stay away from my computer.
hi: मेरे कंप्यूटर से दूर रहो।

source: What are their rights?
hi: क्या है उनके अधिकार?

source: Tom found an ancient gold coin.
hi: टॉम को एक प्राचीन सोने का सिक्का मिला।

source: You have no right to say that.
hi: तुम्हें वैसे कहने का कोई अधिकार नहीं है।

source: I'm not a gambler.
hi: मैं जुआ खेलनेवाला नहीं हूँ।

source: Did you see any pigeons?
hi: कोई कबूतर दिखें?

source: Did you look under the car?
hi: गाड़ी के नीचे देखा?

source: Just take me home.
hi: मुझे बस घर ले चलो.

source: Just listen to me.
hi: बस मेरी बात सुनो।

source: Is this real gold?
hi: क्या यह असली सोना है?

source: What came over you?
hi: तुम्हें हो क्या गया था?

source: Are you ever wrong?
hi: तुम कभी गलत होते हो क्या?

source: Just listen to Tom.
hi: बस टॉम की बात सुनो।

source: Who put that there?
hi: वह वहाँ किसने डाल दिया?

source: Just wait a minute.
hi: बस एक मिनट रुकिए।

source: I can't do this now.
hi: मैं यह अभी नहीं कर सकता।

source: I can't do this without you.
hi: मैं यह तुम्हारे सिवा नहीं कर सकता।

source: I can't go there.
hi: मैं वहाँ नहीं जा सकता।

source: What are you searching for?
hi: तुम क्या खोज रहे हो?

source: I get tired.
hi: मैं थक जाता हूँ।

source: This chair is yours.
hi: यह कुर्सी तुम्हारी है।

source: Tom seems young.
hi: टॉम जवान लगता है।

source: Why did Tom call you?
hi: टॉम ने तुम्हें क्या कहा?

source: What do they call you?
hi: वे तुम्हें क्या कहते हैं?

source: Tom will wait for you.
hi: टॉम तुम्हारा इंतजार करेगा।

source: Tom is more famous than you.
hi: टॉम तुम से ज़्यादा मशहूर है।

source: Would Tom lie to you?
hi: टॉम तुम से झूठ क्यों बोलेगा?

source: They seem to trust you.
hi: लगता है वे तुम पर भरोसा करते हैं।

source: I'm not dead yet.
hi: मैं अभी तक मरा नहीं हूँ।

source: Their answer is yes.
hi: उनका जवाब "हाँ" है।

source: Tom is probably wrong.
hi: टॉम शायद गलत है।

source: Tom isn't winning.
hi: टॉम जीत नहीं रहा है।

source: Tom was winning.
hi: टॉम जीत रहा था।

source: It could be a weapon.
hi: हत्यार हो सकता है।

source: My family is wealthy.
hi: मेरा परिवार धनी है।

source: What's behind the wall?
hi: उस दीवार के पीछे क्या है?

source: Tom is quite ugly.
hi: टॉम काफी बदसूरत है।

source: Tom is very ugly.
hi: टॉम बहुत बदसूरत है।

source: The decision is Tom's.
hi: फैसला टॉम का है।

source: Did you murder Tom?
hi: क्या तुम ने टॉम का खून किया?

source: Is your name Tom?
hi: क्या आपका नाम टॉम है?

source: Do you work with Tom?
hi: क्या तुम टॉम के साथ काम करते हो?

source: Tom won't come today.
hi: टॉम आज नहीं आयेगा।

source: Tom is at home today.
hi: टॉम आज घर पर है।

source: I don't have enough time.
hi: मेरे पास काफी वक़्त नहीं है।

source: The Internet changed everything.
hi: इन्टरनेट ने सब कुछ बदल दिया।

source: I closed my phone.
hi: मैंने मेरा फ़ोन बंद किया।

source: Tom can't eat this.
hi: टॉम यह खा नहीं सकता।

source: What color are they?
hi: वे कौनसे रंग के हैं?

source: What color were they?
hi: वे कौनसे रंग के थे?

source: What proof is there?
hi: क्या सबूत है?

source: What else is there?
hi: और क्या है?

source: There's no one there.
hi: वहाँ कोई नहीं है।

source: You can change that.
hi: तुम वह बदल सकते हो।

source: Do you ever do that?
hi: वैसा कभी करते हो?

source: It was just like that.
hi: बिलकुल वैसे ही था।

source: Why would I wear that?
hi: मैं वह क्यों पहनूंगा?

source: They both are teachers.
hi: दोनों अध्यापक हैं।

source: Does Tom like Earl Grey tea?
hi: क्या टॉम को अर्ल ग्रे चाय पसंद है?

source: Tom is not so tall.
hi: टॉम उतना ऊंचा नहीं है।

source: That's a nice suit.
hi: वह अच्छा सूट है।

source: Tom is quite strong.
hi: टॉम काफी शक्तिशाली है।

source: This is very strange.
hi: यह बहुत अजीब है।

source: It was a nice story.
hi: अच्छी कहानी थी।

source: Why did Tom stop?
hi: टॉम रुका क्यों?

source: Tom sang me a song.
hi: टॉम ने मेरे लिये एक गाना गाया।

source: Tom was singing a song.
hi: टॉम एक गाना गा रहा था।

source: Tom missed his son.
hi: टॉम को अपने बेटे की याद आई।

source: This boy is my son.
hi: यह लड़का मेरा बेटा है।

source: All three men smiled.
hi: तीनों आदमी मुस्कराए।

source: Tom seems very sleepy.
hi: लगता है टॉम को बहुत नींद आई है।

source: Tom is going to sleep.
hi: टॉम सोने जा रहा है।

source: Tom looked at the sky.
hi: टॉम ने आकाश की तरफ देखा।

source: Tom used to be skinny.
hi: टॉम पतला हुआ करता था।

source: Tom never was skinny.
hi: टॉम कभी पतला तो था ही नहीं।

source: The question is simple.
hi: प्रश्न सरल है।

source: The crowd was silent.
hi: भीड़ शांत थी।

source: This is a good show.
hi: यह अच्छा शो है।

source: It was a great show.
hi: बढ़िया शो था।

source: Tom got home at seven.
hi: टॉम सात बजे घर पहुँचा।

source: Tom is very serious.
hi: टॉम बहुत गंभीर है।

source: Tom was sensitive.
hi: टॉम संवेदनशील था।

source: Tom is very selfish.
hi: टॉम बहुत स्वार्थी है।

source: Tom was selfish.
hi: टॉम स्वार्थी था।

source: Is Tom still in school?
hi: टॉम अभी भी स्कूल में है?

source: Forget what I said.
hi: मैंने जो कहा वह भूल जाओ।

source: It made me very sad.
hi: इससे मैं बहुत उदास हुआ।

source: Tom forgot the rules.
hi: टॉम नियम भूल गया।

source: Tom is breaking the rules.
hi: टॉम नियम तोड़ रहा है।

source: Tom came out of his room.
hi: टॉम अपने कमरे से बाहर आया।

source: Tom showed me his room.
hi: टॉम ने मुझे अपना कमरा दिखाया।

source: Tom rented a room.
hi: टॉम ने एक कमरा किराये पर लिया।

source: Let me see your ring.
hi: मुझे अपनी अँगूठी देखने दो।

source: Tom used to be rich.
hi: टॉम अमीर हुआ करता था।

source: Tom wanted to be rich.
hi: टॉम अमीर बनना चाहता था।

source: Tom wants to be rich.
hi: टॉम अमीर बनना चाहता है।

source: Tom is quite rich.
hi: टॉम काफी अमीर है।

source: It made me very rich.
hi: इससे में बहुत अमीर बन गया।

source: Tom is very rich.
hi: टॉम बहुत अमीर है।

source: Your room is ready.
hi: आपका कमरा तैयार है।

source: Tom isn't able to read.
hi: टॉम को पढ़ना नहीं आता।

source: Tom is very quiet.
hi: टॉम बहुत शांत है।

source: Shut the door quickly.
hi: जल्दी से दरवाजा बंद कर दो।

source: Tom was sent to prison.
hi: टॉम को जेल भेज दिया गया।

source: Tom was popular.
hi: टॉम लोकप्रिय था।

source: Tom never was poor.
hi: टॉम गरीब तो कभी था ही नहीं।

source: It was a great plan.
hi: बढ़िया योजना थी।

source: This is a great place.
hi: यह बढ़िया जगह है।

source: Tom loves to party.
hi: टॉम को पार्टी करना पसंद है।

source: I'm the owner.
hi: मालिक मैं हूँ।

source: It's not over.
hi: खतम नहीं हुआ है।

source: The game is not over.
hi: खेल खतम नहीं हुआ है।

source: How did you find out?
hi: तुम्हें कैसे पता चला?

source: When did Tom find out?
hi: टॉम को कब पता चला?

source: This place is ours.
hi: यह जगा हमारी है।

source: What should I order?
hi: क्या मंगाऊँ?

source: There are no options.
hi: और कोई विकल्प नहीं हैं।

source: Why is this door open?
hi: यह दरवाजा खुला क्यों है?

source: The cage is open.
hi: पिंजरा खुला है।

source: The window was open.
hi: खिड़की खुली थी।

source: Tom tried the coat on.
hi: टॉम ने कोट पहन कर देखा।

source: What floor am I on?
hi: मैं किस मंज़िल पर हूँ?

source: Meet me at my office.
hi: मुझे मेरे दफ्तर में मिलो।

source: Tom was obstinate.
hi: टॉम हठी था।

source: Tom has a cold now.
hi: अभी टॉम को जुकाम है।

source: Tom is filling out the forms now.
hi: टॉम अभी वे फार्म भर रहा है।

source: Why are you here now?
hi: तुम अभी इस वक़्त यहाँ क्यों हो?

source: It's all OK now.
hi: अभी सब ठीक है।

source: Tom is resting now.
hi: टॉम अभी आराम कर रहा है।

source: Where's Tom right now?
hi: टॉम इस वक़्त कहाँ है?

source: Tom is going to say no.
hi: टॉम "नहीं" कहने वाला है।

source: My answer is still no.
hi: मेरा जवाब अभी भी "नहीं" है।

source: Tom works all night.
hi: टॉम पूरी रात काम करता है।

source: Tom works at night.
hi: टॉम रात को काम करता है।

source: It was a cold night.
hi: ठंडी रात थी।

source: They left last night.
hi: वे पिछली रात चले गये।

source: Tom was crying last night.
hi: कल रात टॉम रो रहा था।

source: Tom tried to move.
hi: टॉम ने हिलने की कोशिश की।

source: This is a gold mine.
hi: यह सोने की खान है।

source: This money is mine.
hi: यह पैसा मेरा है।

source: Nothing here is mine.
hi: यहाँ का कुछ भी मेरा नहीं है।

source: This gold is mine.
hi: यह सोना मेरा है।

source: This fight is mine.
hi: यह लड़ाई मेरी है।

source: The decision is mine.
hi: फैसला मेरा था।

source: The mistake was mine.
hi: गलती मेरी थी।

source: What could it mean?
hi: इसका क्या मतलब हो सकता है?

source: Did Tom ask about me?
hi: क्या टॉम ने मेरे बारे में पूँछा?

source: Tom lives above me.
hi: टॉम मेरे उपर रहता है।

source: Tom was looking at me.
hi: टॉम मुझे देख रहा था।

source: Tom used to work for me.
hi: टॉम मेरे लिए काम करता था।

source: This is easy for me.
hi: यह मेरे लिये आसान नहीं है।

source: Tom tried to stop me.
hi: टॉम ने मुझे रोकने की कोशिश की।

source: Tom is nice, isn't he?
hi: टॉम अच्छा है, है ना?

source: Tom is here, isn't he?
hi: टॉम यहाँ है, है ना?

source: Tom is happy, isn't he?
hi: टॉम खुश है, है ना?

source: Tom is good, isn't he?
hi: टॉम अच्छा है, है ना?

source: Tom is loyal, isn't he?
hi: टॉम वफादार है, है ना?

source: Tom took Mary along.
hi: टॉम मैरी को साथ ले गया।

source: Is it morning already?
hi: सुबह हो भी गयी?

source: Is Germany dangerous?
hi: क्या जर्मनी खतरनाक है?

source: Tom isn't artistic.
hi: टॉम कलात्मक नहीं है।

source: Tom is quite artistic.
hi: टॉम काफी कलात्मक है।

source: Tom seems artistic.
hi: टॉम कलात्मक लगता है।

source: Tom is very artistic.
hi: टॉम बहुत कलात्मक है।

source: What else would it be?
hi: और क्या हो सकता है?

source: How could that be?
hi: ऐसे कैसे हो सकता है?

source: Tom is trying his best.
hi: टॉम अपनी पूरी कोशिश कर रहा है।

source: Tom came here today by bicycle.
hi: आज टॉम यहाँ सायकिल से आया।

source: Tom couldn't breathe.
hi: टॉम साँस नहीं ले पा रहा था।

source: Call me when you can.
hi: हो सके तब कॉल करना।

source: It could be cancer.
hi: कैंसर हो सकता है।

source: Tom never got caught.
hi: टॉम कभी पकड़ा नहीं गया।

source: Tom didn't need to come.
hi: टॉम को आने की आवश्यकता नहीं थी।

source: Wrong!
hi: गलत!

source: What else can Tom do?
hi: टॉम और क्या कर सकता है?

source: My name is on the door.
hi: दरवाजे पर मेरा नाम है।

source: Tom stood near the door.
hi: टॉम दरवाज़े के नज़दीक खड़ा रहा।

source: Tom set his beer down.
hi: टॉम ने अपनी बीयर नीचे रख दी।

source: Change is never easy.
hi: बदलाव कभी आसान नहीं होता।

source: The place is empty.
hi: वह जगह खाली है।

source: Tom is going to be famous.
hi: टॉम प्रसिद्ध बनने वाला है।

source: Where did Tom and Mary go?
hi: टॉम और मैरी कहाँ गये?

source: It's not good.
hi: अच्छा नहीं है।

source: Tom just wants to be your friend.
hi: टॉम को बस तुम से दोस्ती करनी है।

source: I found him.
hi: मुझे वह मिला।

source: It could be heroin.
hi: हेरोइन हो सकता है।

source: I'm with him.
hi: मैं उसके साथ हूँ।

source: I started it.
hi: मैंने शुरू किया।

source: Tom was only joking.
hi: टॉम तो बस मज़ाक कर रहा था।

source: Tom was just joking.
hi: टॉम तो बस मज़ाक कर रहा था।

source: Tom is a good man.
hi: टॉम अच्छा आदमी है।

source: Tom is our best pilot.
hi: टॉम हमारा सबसे अच्छा पाइलट है।

source: Tom wasn't a prisoner.
hi: टॉम कैदी नहीं था।

source: Tom is swimming in the river.
hi: टॉम नदी में तैर रहा है।

source: Tom came into the room.
hi: टॉम कमरे में आया।

source: Tom is standing in the center of the room.
hi: टॉम कमरे के बीच में खड़ा है।

source: Tom isn't going to sing.
hi: टॉम गाने वाला नहीं है।

source: Who sent you that?
hi: तुम्हें वह किसने भेजा?

source: Hey, what's that?
hi: अरे! वह क्या है?

source: Hey, what's this?
hi: अरे! यह क्या है?

source: They can't see Tom.
hi: वे टॉम को नहीं देख सकते।

source: How crazy is Tom?
hi: टॉम कितना पागल है?

source: I forgave Tom.
hi: मैंने टॉम को माफ़ किया।

source: They never caught Tom.
hi: उन्होंने टॉम को कभी पकड़ा नहीं।

source: What'll Tom do tomorrow?
hi: टॉम कल क्या करेगा?

source: Why are you working for Tom?
hi: तुम टॉम के लिये क्यों काम कर रहे हो?

source: Tom has lied to us.
hi: टॉम ने हम से झूठ बोला है।

source: They're lying to us.
hi: वे हम से झूठ बोल रहे हैं।

source: They're afraid of us.
hi: वे हम से डरते हैं।

source: Tom is just like us.
hi: टॉम बिलकुल हमारी तरह है।

source: Tom is headed this way.
hi: टॉम इस तरफ़ आ रहा है।

source: I didn't know Tom last year.
hi: पिछले साल मैं टॉम को जानता नहीं था।

source: Tom isn't even here yet.
hi: टॉम तो यहाँ अभी तक आया भी नहीं है।

source: They can't see you.
hi: वे तुम्हें देख नहीं सकते।

source: Have some tea.
hi: जरा सी चाय लीजिए।

source: Should Hindi be taught in schools across India?
hi: क्या हिन्दी भारत भर की पाठशालाओं में सिखाई जानी चाहिए?

source: Tom is not as fat as me.
hi: टॉम मेरे जितना मोटा नहीं है।

source: I've betrayed my husband.
hi: मैनें अपने पती को धोखा दिया है।

source: No other language is as beautiful as Portuguese.
hi: पुर्त्तगाली जितनी सुंदर और कोई भाषा नहीं है।

source: Tom lost his control.
hi: टॉम ने नियंत्रण खो दिया था।

source: Isaac Newton was an English physicist.
hi: आइज़ैक न्यूटन एक अंग्रेज़ भौतिक विज्ञानी थे।

source: What is all this rumpus about?
hi: यह हंगामा काहे के लिए है?

source: After sex, I fell asleep with my head on her belly.
hi: सेक्स के बाद मैं उसके पेट पर सिर रख कर सो गया।

source: I want these.
hi: मुझे ये चाहिए।

source: I don't let my kids watch TV.
hi: मैं अपने बच्चों को टीवी नहीं देखने देता।

source: Tom wasn't my husband at that time.
hi: उस वक़्त टॉम मेरा पति नहीं था।

source: Telugu is spoken in the Indian states of Andhra Pradesh and Telangana.
hi: तेलुगू आंध्र प्रदेश और तेलंगना इन भारतीय राज्यों में बोली जाती है।

source: There is gold in green forests.
hi: हरे वनों में सोना होता है।

source: Tom was home alone.
hi: टॉम घर पर अकेला था।

source: Is this Tom's?
hi: टॉम का है?

source: It's a joke.
hi: मज़ाक है।

source: Even men sometimes cry.
hi: मर्द भी कभी-कबार रोते हैं।

source: Is everybody all right?
hi: सब ठीक हैं?

source: Tom said very little.
hi: टॉम बहुत कम बोला।

source: "Have you seen Tom today?" "No, I haven't."
hi: "आज टॉम को देखा?" "नहीं, नहीं देखा।"

source: Netflix is now available in Europe.
hi: नेटफ़्लिक्स अब युरोप में उपलब्ध है।

source: Which way is the elevator?
hi: लिफ़्ट किस तरफ़ है?

source: I don't know what's going on around here.
hi: पता नहीं यहाँ क्या चल रहा है।

source: Can I get some coffee?
hi: थोड़ी कॉफ़ी मिलेगी?

source: I ate too much today.
hi: मैंने आज कुछ ज़्यादा ही खा लिया।

source: I ate too much yesterday.
hi: मैंने कल कुछ ज़्यादा ही खा लिया।

source: Russia is larger than Pluto.
hi: रूस प्लूटो से बड़ा है।

source: Tom must be so scared.
hi: टॉम कितना डरा हुआ होगा।

source: Thanks for last night.
hi: कल रात के लिये शुक्रिया।

source: Would you like to live in Ukraine?
hi: क्या आप युक्रेन में रहना पसंद करेंगे?

source: It's still not working.
hi: अभी भी काम नहीं कर रहा है।

source: It's not real money.
hi: असली पैसा नहीं है।

source: It's for your own good.
hi: तुम्हारे ही भले के लिये है।

source: It isn't much further.
hi: ज़्यादा दूर नहीं है।

source: It's been three days.
hi: तीन दिन हो गए हैं।

source: Let me do it my way.
hi: मुझे अपने तरीके से करने दो।

source: There are three of us.
hi: हम तीन हैं।

source: They're waiting for us.
hi: वे हमारे लिये रुके हैं।

source: Now it's your turn.
hi: अब तुम्हारी बारी है।

source: They're afraid of Tom.
hi: वे टॉम से डरते हैं।

source: They begin beating Tom.
hi: वे टॉम को पीटने लगे।

source: Who listens to Tom?
hi: टॉम की कौन सुनता है?

source: Where did you send Tom?
hi: तुम ने टॉम को कहाँ भेजा?

source: I was ready for Tom.
hi: मैं टॉम के लिये तैयार था।

source: Let go of the bottle.
hi: बोतल छोड़।

source: I turned the computer off.
hi: मैंने कम्प्यूटर बंद कर दिया।

source: He is my husband.
hi: यह मेरा पति है।

source: Tom is my relative.
hi: टॉम मेरा रिश्तेदार है।

source: Do they speak Spanish in Mexico?
hi: मेक्सिको में स्पैनिश बोली जाती है क्या?

source: Spanish is spoken in the Central and the South Americas.
hi: स्पैनिश मध्य और दक्षिण अमेरिका में बोली जाती है।

source: Hell is a place where it smells bad and nobody loves anybody.
hi: नर्क एक ऐसी जगह जो बदबूदार है और किसी को कोई पसंद नहीं हैं ।

source: Your team is better than ours.
hi: आपका दल हमसे बेहतर है |

source: The tiger licked him.
hi: बाघ ने उसे चाटा।

source: The tiger caught the guy's neck and killed him by pulling it.
hi: बाघ ने युवक की गर्दन पकड़ी और खींचकर मार डाला।

source: I have an important call to make.
hi: मुझे एक जरूरी कॉल करनी है ।

source: Why are you still not sleeping?
hi: तुम अभी तक क्यों नहीं सोए ?

source: I like to breathe the clean mountain air.
hi: मुझे स्वच्छ हवा में साँस लेना पसंद है।

source: France is a country in west Europe.
hi: फ्रांस पश्चिम यूरोप का एक देश है।

source: Cats kill rats.
hi: बिल्ली चूहें मारती हैं।

source: Uganda is an African country.
hi: युगांडा एक अफ़्रीकी देश है।

source: I don't know what they know.
hi: मुझे नहीं पता कि उन्हें क्या पता है।

source: I don't know what he knows.
hi: मुझे नहीं पता कि उसे क्या पता है।

source: I don't know what she knows.
hi: मुझे नहीं पता कि उसे क्या पता है।

source: I don't know what Tom knows.
hi: मुझे नहीं पता कि टॉम को क्या पता है।

source: I don't know how, but you did it.
hi: पता नहीं कैसे पर तुमने कर दिया।

source: I don't know how, but Tom did it.
hi: पता नहीं कैसे पर टॉम ने कर दिया।

source: I don't know how, but she did it.
hi: पता नहीं कैसे पर उसने कर दिया।

source: The scientists are working on a new experiment.
hi: वैज्ञानिक नए प्रयोग पर काम कर रहे है I

source: What's a jungle?
hi: जंगल क्या होता है I

source: Canada is a large country.
hi: कनाडा एक बड़ा देश है ।

source: I think he's a bad person.
hi: मुझे लगता है कि वह एक बुरा आदमी है ।

source: Although fatalities tend to be rare, many people died as a result of volcanic eruptions during the last quarter century.
hi: घायलो की संख्या कम है पर पिछले सवा सौ वर्षों में ज्वालामुखी विस्फोटो के कारण बहुत लोग मरे है ।

source: Khalid has a variety of pens.
hi: ख़ालिद के पास तरह-तरह के कलम है।

source: I've read the first page.
hi: मैंने पहला पृष्ठ पढ़ा लिया I

source: It was sort of fun.
hi: वो मजेदार था I

source: I have some stuff to do at home.
hi: मुझे घर में थोड़ा काम करना है I

source: That's weird, isn't it?
hi: ये अजीब है, नहीं?

source: Everyone felt sorry for Tom.
hi: सब टॉम के लिए दुःखी थे I

source: We all felt sorry for Tom.
hi: हम सब टॉम के लिए दुःखी थे।

source: Enjoy.
hi: मज़े करो।

source: I'm an animal.
hi: मैं एक जानवर हूँ I

source: It shouldn't take long to find Tom.
hi: टॉम को ढूँढने में समय नहीं लगना चाहिए।

source: It took me a while to find Tom.
hi: मुझे टॉम को ढूँढने में समय लग गया।

source: If Tom doesn't help us, we'll never be able to finish this on time.
hi: अगर टॉम हमारी मदद नहीं करेगा तो हम ये समय पर कभी नहीं कर पायेंगे।

source: I've been given until tomorrow to finish this.
hi: मुझे ये कल तक खतम करना है ।

source: I'm learning the Burmese language.
hi: मैं बर्मी भाषा सीख रहा हूँ।

source: As far as I know, she's not yet married.
hi: जहाँ तक की मुझे पता है, उसने अभी तक शादी नहीं की है।

source: Tom threw a rock at the tree.
hi: टॉम ने पेड़ पर एक पत्थर फेंका।

source: Am I ready to die?
hi: क्या मैं मरने के लिये तयार हूँ?

source: The girl is drinking tea now.
hi: लड़की अभी चाय पी रही है।

source: French women are beautiful.
hi: फ़्रांसीसी औरतें खूबसूरत होती हैं।

source: I'm from Syria.
hi: मैं सीरिया से हूँ।

source: Her arms and legs are long.
hi: उसके हात-पैर लंबे हैं।

source: He is Spanish.
hi: वह स्पेनी है।

source: He is Portuguese.
hi: वह पुर्त्तगाली है।

source: Tom is poor, but he's happy.
hi: टाम ग़रीब है लेकिन वह खुश है।
